###################################################################

# Created by write_sdc on Mon Dec 19 20:56:54 2016

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
create_clock [get_ports clock]  -name ideal_clock1  -period 3.846  -waveform {0 1.923}
set_input_delay -clock ideal_clock1  0  [get_ports start]
set_input_delay -clock ideal_clock1  0  [get_ports {R[7]}]
set_input_delay -clock ideal_clock1  0  [get_ports {R[6]}]
set_input_delay -clock ideal_clock1  0  [get_ports {R[5]}]
set_input_delay -clock ideal_clock1  0  [get_ports {R[4]}]
set_input_delay -clock ideal_clock1  0  [get_ports {R[3]}]
set_input_delay -clock ideal_clock1  0  [get_ports {R[2]}]
set_input_delay -clock ideal_clock1  0  [get_ports {R[1]}]
set_input_delay -clock ideal_clock1  0  [get_ports {R[0]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s1[7]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s1[6]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s1[5]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s1[4]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s1[3]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s1[2]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s1[1]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s1[0]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s2[7]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s2[6]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s2[5]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s2[4]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s2[3]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s2[2]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s2[1]}]
set_input_delay -clock ideal_clock1  0  [get_ports {s2[0]}]
set_output_delay -clock ideal_clock1  0  [get_ports {motionx[3]}]
set_output_delay -clock ideal_clock1  0  [get_ports {motionx[2]}]
set_output_delay -clock ideal_clock1  0  [get_ports {motionx[1]}]
set_output_delay -clock ideal_clock1  0  [get_ports {motionx[0]}]
set_output_delay -clock ideal_clock1  0  [get_ports {motiony[3]}]
set_output_delay -clock ideal_clock1  0  [get_ports {motiony[2]}]
set_output_delay -clock ideal_clock1  0  [get_ports {motiony[1]}]
set_output_delay -clock ideal_clock1  0  [get_ports {motiony[0]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressR[7]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressR[6]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressR[5]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressR[4]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressR[3]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressR[2]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressR[1]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressR[0]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS1[9]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS1[8]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS1[7]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS1[6]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS1[5]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS1[4]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS1[3]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS1[2]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS1[1]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS1[0]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS2[9]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS2[8]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS2[7]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS2[6]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS2[5]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS2[4]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS2[3]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS2[2]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS2[1]}]
set_output_delay -clock ideal_clock1  0  [get_ports {AddressS2[0]}]
set_output_delay -clock ideal_clock1  0  [get_ports {BestDist[7]}]
set_output_delay -clock ideal_clock1  0  [get_ports {BestDist[6]}]
set_output_delay -clock ideal_clock1  0  [get_ports {BestDist[5]}]
set_output_delay -clock ideal_clock1  0  [get_ports {BestDist[4]}]
set_output_delay -clock ideal_clock1  0  [get_ports {BestDist[3]}]
set_output_delay -clock ideal_clock1  0  [get_ports {BestDist[2]}]
set_output_delay -clock ideal_clock1  0  [get_ports {BestDist[1]}]
set_output_delay -clock ideal_clock1  0  [get_ports {BestDist[0]}]
